resources/e2eTestData.json

{
    "payments": {
        "insertPayment": {
            "title": "string",
            "description": "string",
            "amount": 43,
            "currency": "string",
            "startTimestamp": 10,
            "endTimestamp": 13,
            "numberOfPayments": 5,
            "type": 1,
            "frequency": 10,
            "merchantAddress": "string",
            "networkID": 3
        },
        "updatePayment": {
            "id": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "promo": "string",
            "status": 1,
            "customerAddress": "string",
            "amount": 43,
            "currency": "string",
            "startTimestamp": 10,
            "endTimestamp": 13,
            "numberOfPayments": 5,
            "nextPaymentDate": "123456789",
            "lastPaymentDate": "123456789",
            "type": 1,
            "frequency": 10,
            "registerTxHash": "string",
            "registerTxStatus": 1,
            "executeTxHash": "string",
            "executeTxStatus": 1,
            "merchantAddress": "string",
            "pullPaymentAddress": "string",
            "userId": "string",
            "networkID": 3
        }
    }
}